In [1]:
try:
    import pandas
    print("Pandas is installed")
except ImportError:
    print("Pandas is NOT installed")

Pandas is installed

In [ ]:
# CSV stands for Comma Separated File
pandas have two main types :

1.DataFrames (df) (2D + labeled)
2.Series (1D labeled array)

In [37]:
import pandas as pd
data = {
    'Name': ['Sadam','Afridi','Hussain'],
    'Age' : [30,23,33],
    'Country': ['Iraq','Pakistan','Iran']
}

#LOAD DATA FROM DICTIONARY
df = pd.DataFrame(data)

print(df)

      Name  Age   Country
0    Sadam   30      Iraq
1   Afridi   23  Pakistan
2  Hussain   33      Iran

In [51]:
# data frames (2d labeled data structure)
import pandas as pd

#LOAD DATA FROM EXCEL
# df = pd.read_excel("constructor_standings.xlsx")

#LOAD DATA FROM CSV
df = pd.read_csv("constructor_standings.csv")
df

,constructorStandingsId,raceId,constructorId,points,position,positionText,wins
0,1,18,1,14.0,1,1,1
1,2,18,2,8.0,3,3,0
2,3,18,3,9.0,2,2,0
3,4,18,4,5.0,4,4,0
4,5,18,5,2.0,5,5,0
...,...,...,...,...,...,...,...
13386,28978,1144,15,4.0,10,10,0
13387,28979,1144,210,58.0,7,7,0
13388,28980,1144,215,46.0,8,8,0
13389,28981,1144,3,17.0,9,9,0
13390,28982,1144,214,65.0,6,6,0

In [49]:
# EXPLORING DATAFRAMES

df = pd.read_csv("constructor_standings.csv")

df.head()  # it print first five rows

,constructorStandingsId,raceId,constructorId,points,position,positionText,wins
0,1,18,1,14.0,1,1,1
1,2,18,2,8.0,3,3,0
2,3,18,3,9.0,2,2,0
3,4,18,4,5.0,4,4,0
4,5,18,5,2.0,5,5,0

In [53]:
df = pd.read_csv("constructor_standings.csv")

df.tail()  # it print last five rows

,constructorStandingsId,raceId,constructorId,points,position,positionText,wins
13386,28978,1144,15,4.0,10,10,0
13387,28979,1144,210,58.0,7,7,0
13388,28980,1144,215,46.0,8,8,0
13389,28981,1144,3,17.0,9,9,0
13390,28982,1144,214,65.0,6,6,0

In [55]:
df = pd.read_csv("constructor_standings.csv")

df.info()  # it gives you general information on the data frame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13391 entries, 0 to 13390
Data columns (total 7 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   constructorStandingsId  13391 non-null  int64
 1   raceId                  13391 non-null  int64
 2   constructorId           13391 non-null  int64
 3   points                  13391 non-null  float64
 4   position                13391 non-null  int64
 5   positionText            13391 non-null  object
 6   wins                    13391 non-null  int64
dtypes: float64(1), int64(5), object(1)
memory usage: 732.4+ KB

In [57]:
df = pd.read_csv("constructor_standings.csv")

df.describe()  # generate descriptive statistics

,constructorStandingsId,raceId,constructorId,points,position,wins
count,13391.000000,13391.000000,13391.000000,13391.000000,13391.000000,13391.000000
mean,16982.110821,535.399821,49.603390,37.178515,7.226047,0.697409
std,8868.446172,307.705928,61.213953,84.346048,4.355923,1.879569
min,1.000000,1.000000,1.000000,0.000000,1.000000,0.000000
25%,8883.500000,302.000000,6.000000,0.000000,4.000000,0.000000
50%,20634.000000,508.000000,25.000000,7.000000,7.000000,0.000000
75%,25047.500000,740.000000,58.000000,33.000000,10.000000,0.000000
max,28982.000000,1144.000000,215.000000,860.000000,22.000000,21.000000

In [61]:
df = pd.read_csv("constructor_standings.csv")

df.columns  # display columns name

Index(['constructorStandingsId', 'raceId', 'constructorId', 'points',
       'position', 'positionText', 'wins'],
      dtype='object')

In [63]:
df = pd.read_csv("constructor_standings.csv")

df.index               # gives us starting and ending index , also steps

RangeIndex(start=0, stop=13391, step=1)

In [65]:
# Series ( 1D array or a column)

df = pd.read_csv("constructor_standings.csv")

df["raceId"]

0          18
1          18
2          18
3          18
4          18
         ...
13386    1144
13387    1144
13388    1144
13389    1144
13390    1144
Name: raceId, Length: 13391, dtype: int64

In [67]:
df = pd.read_csv("constructor_standings.csv")

len(df["raceId"])   # displaying length

13391

In [69]:
df = pd.read_csv("constructor_standings.csv")

set(df["wins"])   # displaying unique values

{0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21}

In [75]:
df = pd.read_csv("constructor_standings.csv")

df[["raceId","wins"]]

       raceId  wins
0          18     1
1          18     0
2          18     0
3          18     0
4          18     0
...       ...   ...
13386    1144     0
13387    1144     0
13388    1144     0
13389    1144     0
13390    1144     0

[13391 rows x 2 columns]

In [79]:
df = pd.read_csv("constructor_standings.csv")

df.iloc[9]                # index location (accessing 10th row)

constructorStandingsId     10
raceId                     19
constructorId               4
points                    6.0
position                    5
positionText                5
wins                        0
Name: 9, dtype: object

In [25]:
import pandas as pd

df = pd.read_csv("constructor_standings.csv")

df.iloc[0]          # index location (accessing 1st row)

constructorStandingsId       1
raceId                      18
constructorId                1
points                    14.0
position                     1
positionText                 1
wins                         1
Name: 0, dtype: object

In [27]:
df = pd.read_csv("constructor_standings.csv")

list (df.iloc[9] )               # converting 10th row into list

[10, 19, 4, 6.0, 5, '5', 0]

In [41]:
# APPLYING FILTERS

df = pd.read_csv("constructor_standings.csv")

df[df["raceId"]==18]    # printing all the columns having raceid equal to 18

,constructorStandingsId,raceId,constructorId,points,position,positionText,wins
0,1,18,1,14.0,1,1,1
1,2,18,2,8.0,3,3,0
2,3,18,3,9.0,2,2,0
3,4,18,4,5.0,4,4,0
4,5,18,5,2.0,5,5,0
5,6,18,6,1.0,6,6,0

In [47]:
# APPLYING  MULTIPLE FILTERS

df = pd.read_csv("constructor_standings.csv")

df[(df["raceId"]==18) & (df["position"]==1)]     # printing all the columns having raceid equal to 18 AND position equal to 1

,constructorStandingsId,raceId,constructorId,points,position,positionText,wins
0,1,18,1,14.0,1,1,1

In [49]:
# APPLYING  MULTIPLE FILTERS

df = pd.read_csv("constructor_standings.csv")

df[(df["raceId"]==18) | (df["position"]==1)]     # printing all the columns having raceid equal to 18 OR position equal to 1

,constructorStandingsId,raceId,constructorId,points,position,positionText,wins
0,1,18,1,14.0,1,1,1
1,2,18,2,8.0,3,3,0
2,3,18,3,9.0,2,2,0
3,4,18,4,5.0,4,4,0
4,5,18,5,2.0,5,5,0
...,...,...,...,...,...,...,...
13344,28936,1140,1,566.0,1,1,5
13354,28946,1141,1,593.0,1,1,5
13364,28956,1142,1,608.0,1,1,5
13374,28966,1143,1,640.0,1,1,5
13384,28976,1144,1,666.0,1,1,6

In [59]:
# APPLYING FILTERS

df = pd.read_csv("constructor_standings.csv")

df[df["points"]> 800]    # printing all the columns have points greater than 800

,constructorStandingsId,raceId,constructorId,points,position,positionText,wins
13131,28693,1119,9,822.0,1,1,20
13141,28703,1120,9,860.0,1,1,21

In [65]:
# ADVANCE FILTERING

import pandas as pd
data = {
    'Name': ['Sadam','Afridi','Hussain','Sairaj'],
    'Age' : [30,23,33,22],
    'Country': ['Iraq','Pakistan','Iran','Pakistan']
}

df = pd.DataFrame(data)

df[df["Name"].str.startswith("S")]   # give me all rows whose name starts with "s"

     Name  Age   Country
0   Sadam   30      Iraq
3  Sairaj   22  Pakistan

In [67]:
# ADVANCE FILTERING

import pandas as pd
data = {
    'Name': ['Sadam','Afridi','Hussain','Sairaj'],
    'Age' : [30,23,33,22],
    'Country': ['Iraq','Pakistan','Iran','Pakistan']
}

df = pd.DataFrame(data)

df[df["Name"].str.endswith("n")]   # give me all rows whose name starts with "n"

      Name  Age Country
2  Hussain   33    Iran

In [83]:
# ADVANCE FILTERING

import pandas as pd
data = {
    'Name': ['Sadam','Afridi','Hussain','Sairaj'],
    'Age' : [30,23,33,22],
    'Country': ['Iraq','Pakistan','Iran','Pakistan']
}

df = pd.DataFrame(data)

df[df["Country"].isin(["Pakistan","Iran"])]   # give me all rows having country pakistan or iran

      Name  Age   Country
1   Afridi   23  Pakistan
2  Hussain   33      Iran
3   Sairaj   22  Pakistan

In [85]:
# ADVANCE FILTERING

import pandas as pd
data = {
    'Name': ['Sadam','Afridi','Hussain','Sairaj'],
    'Age' : [30,23,33,22],
    'Country': ['Iraq','Pakistan','Iran','Pakistan']
}

df = pd.DataFrame(data)

df[~df["Country"].isin(["Pakistan","Iran"])]   # give me all rows not having country pakistan or iran (~) not operator

    Name  Age Country
0  Sadam   30    Iraq

In [87]:
# UPDATING DATA

import pandas as pd
data = {
    'Name': ['Sadam','Afridi','Hussain','Sairaj'],
    'Age' : [30,23,33,22],
    'Country': ['Iraq','Pakistan','Iran','Pakistan']
}

df = pd.DataFrame(data)

df.loc[df["Country"] == "Pakistan"]  # locate the row where country is pakistan

     Name  Age   Country
1  Afridi   23  Pakistan
3  Sairaj   22  Pakistan

In [97]:
# UPDATING DATA

import pandas as pd
data = {
    'Name': ['Sadam','Afridi','Hussain','Sairaj'],
    'Age' : [30,23,33,22],
    'Country': ['Iraq','Pakistan','Iran','Pakistan']
}

df = pd.DataFrame(data)

df.loc[df["Country" ] == "Iraq" , "Name"] = "Sadam Hussain"   # locate the row where country is iran and update name to sadam hussain 

df.loc[df["Country"] == "Iraq"]

            Name  Age Country
0  Sadam Hussain   30    Iraq

In [101]:
import pandas as pd
data = {
    'Name': ['Sadam','Afridi','Hussain','Sairaj'],
    'Age' : [30,23,33,22],
    'Country': ['Iraq','Pakistan','Iran','Pakistan']
}

df = pd.DataFrame(data)

df.loc[df["Country" ] == "Pakistan" , "Country"] = "United Pakistan"   # locate the row where country is pakistan and update it to united pakistan 

df.loc[df["Country"] == "United Pakistan"]

     Name  Age          Country
1  Afridi   23  United Pakistan
3  Sairaj   22  United Pakistan

In [105]:
import pandas as pd
data = {
    'Name': ['Sadam','Afridi','Hussain','Sairaj'],
    'Age' : [30,23,33,22],
    'Country': ['Iraq','Pakistan','Iran','Pakistan']
}

df = pd.DataFrame(data)

df["Country"] = df["Country"].str.upper()  # upper case countries 

df.head()

      Name  Age   Country
0    Sadam   30      IRAQ
1   Afridi   23  PAKISTAN
2  Hussain   33      IRAN
3   Sairaj   22  PAKISTAN

In [111]:
import pandas as pd
data = {
    'Name': ['Sadam','Afridi','Hussain','Sairaj'],
    'Age' : [30,23,33,22],
    'Country': ['Iraq','Pakistan','Iran','Pakistan']
}

df = pd.DataFrame(data)

df["Name"] = df["Name"].str.lower()   # lower case names 

df.head()

      Name  Age   Country
0    sadam   30      Iraq
1   afridi   23  Pakistan
2  hussain   33      Iran
3   sairaj   22  Pakistan

In [119]:
# DELETING DATA

import pandas as pd
data = {
    'Name': ['Sadam','Afridi','Hussain','Sairaj'],
    'Age' : [30,23,33,22],
    'Country': ['Iraq','Pakistan','Iran','Pakistan']
}
df = pd.DataFrame(data)
df=df.drop(2)   # dropping row 2 (3rd)

df.head()

     Name  Age   Country
0   Sadam   30      Iraq
1  Afridi   23  Pakistan
3  Sairaj   22  Pakistan

In [121]:
# CLEANING DATA

import pandas as pd
data = {
    'Name': ['Sadam','Afridi','Hussain','Sairaj','jan'],
    'Age' : [30,23,33,22,0],
    'Country': ['Iraq','Pakistan','Iran','Pakistan','']
}
df = pd.DataFrame(data)
df.head()

      Name  Age   Country
0    Sadam   30      Iraq
1   Afridi   23  Pakistan
2  Hussain   33      Iran
3   Sairaj   22  Pakistan
4      jan    0

In [159]:
# CLEANING DATA
import numpy as np
import pandas as pd
data = {
    'Name': ['Sadam','Afridi','Hussain','Sairaj','jan'],
    'Age' : [30,23,33,22,np.nan],
    'Country': ['Iraq','Pakistan','Iran','Pakistan','']
}
df = pd.DataFrame(data)
df.dropna()    # dropping rows having empty cells or NaN

      Name   Age   Country
0    Sadam  30.0      Iraq
1   Afridi  23.0  Pakistan
2  Hussain  33.0      Iran
3   Sairaj  22.0  Pakistan

In [169]:
# CLEANING DATA

import pandas as pd
data = {
    'Name': ['Sadam','Afridi','Hussain','Sairaj','jan'],
    'Age' : [30,23,33,22,np.nan],
    'Country': ['Iraq','Pakistan','Iran','Pakistan','']
}
df.fillna(0, inplace=True)    # filling nat a number by 0
df.head()

      Name  Age   Country
0    Sadam   30      Iraq
1   Afridi   23  Pakistan
2  Hussain   33      Iran
3   Sairaj   22  Pakistan
4      jan    0

In [171]:
# RENAMING COLUMNS
import pandas as pd
data = {
    'Name': ['Sadam','Afridi','Hussain','Sairaj','jan'],
    'Age' : [30,23,33,22,0],
    'Country': ['Iraq','Pakistan','Iran','Pakistan','']
}
df = pd.DataFrame(data)
df.rename(columns={'Name': 'Full_Name', 'Country': 'Your_Country'}, inplace=True)
df.head()

  Full_Name  Age Your_Country
0     Sadam   30         Iraq
1    Afridi   23     Pakistan
2   Hussain   33         Iran
3    Sairaj   22     Pakistan
4       jan    0

In [23]:
# ANALYZING DATA
import pandas as pd
data = {
    'Name': ['Sadam','Afridi','Hussain','Sairaj','jan'],
    'Age' : [30,23,33,22,30],
    'Country': ['Iraq','Pakistan','Iran','Pakistan','']
}
df = pd.DataFrame(data)

df["Age"].value_counts()

Age
30    2
23    1
33    1
22    1
Name: count, dtype: int64

In [25]:
df["Age"].unique()

array([30, 23, 33, 22], dtype=int64)

In [27]:
df["Age"].nunique()

4

In [29]:
df["Age"].count()

5

In [31]:
df["Age"].mean()

27.6

In [33]:
df["Age"].median()

30.0

In [35]:
df["Age"].mode()

0    30
Name: Age, dtype: int64

In [37]:
df["Age"].std()

4.8270073544588685

In [39]:
df["Age"].var()

23.3

In [41]:
df["Age"].min()

22

In [43]:
df["Age"].max()

33

In [45]:
df.groupby("Country")["Age"].sum()

Country
            30
Iran        33
Iraq        30
Pakistan    45
Name: Age, dtype: int64

In [53]:
df.sort_values("Age", ascending=True)

      Name  Age   Country
3   Sairaj   22  Pakistan
1   Afridi   23  Pakistan
0    Sadam   30      Iraq
4      jan   30
2  Hussain   33      Iran

In [55]:
df.to_csv("new_file.csv" , index=True)